[
  {
    "groupId": 406030,
    "groupName": "In person",
    "speakers": [
      {
        "id": "03acd4fe-2e56-42b9-9361-056659881697",
        "firstName": "Alpha",
        "lastName": "Iyajini",
        "fullName": "Alpha Iyajini",
        "bio": "With over a decade of expertise in product design, Alpha Iyajini has built a career around shaping digital experiences that bridge technology and people. From fintech and e-commerce to blockchain, AI-driven platforms, MedTech, EduTech, agro-tech, and fashion commerce, his work consistently reflects a blend of creativity, precision, and user-centered thinking.\r\n\r\nAs the COO and Design Lead at Control Genesis, Alpha has spearheaded projects that range from community-focused marketplaces to playful crypto ecosystems, each defined by innovation and cultural relevance. His leadership ensures that every solution moves beyond functionality, delivering value that resonates with both users and stakeholders.\r\n\r\nAlpha’s career is driven by a passion for experimentation and agility. Whether scaling design systems, launching startups, or nurturing digital communities, he approaches every project as an opportunity to inspire trust, build culture, and push boundaries. This relentless drive positions him as a distinct voice in the evolution of modern digital design and product innovation.",
        "tagLine": "COO & Design Lead - CONTROL GENESIS LLC",
        "profilePicture": "https://sessionize.com/image/5888-400o400o1-47eVirNz4NH5UADCYZbXjX.jpg",
        "sessions": [
          {
            "id": 1048090,
            "name": "Agility Beyond Development: A Design Perspective"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/alpha-iyajini-0a4048304/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "419f4891-85c8-42ef-a9aa-193cc0e52175",
        "firstName": "Emmanuel",
        "lastName": "Ekunke",
        "fullName": "Emmanuel Ekunke",
        "bio": "Emmanuel Ekunke is the visionary CEO and Founder of Demfati, a leading event technology platform that is revolutionizing ticketing, online voting, and user engagement across the globe. Founded in 2020, Demfati is at the forefront of the conversational commerce movement, utilizing proprietary AI (including their \"Deeva\" chatbot) to enable seamless, cross-platform transactions via services like WhatsApp and Telegram.\r\n\r\n​Under His leadership, Demfati has redefined what it means to be an all-in-one event solution, successfully processing over 20,000+ tickets, 20,000+ forms filled and 100,000+ votes by prioritizing simplicity, accessibility, and automation. Emmanuel's core mission is to bridge digital barriers and empower creators in high-growth economies by leveraging AI to deliver immersive, efficient, and scalable digital experiences. He is a passionate advocate for Africa-first technology that is ready for the world stage.",
        "tagLine": "CEO and Co-founder - Demfati",
        "profilePicture": "https://sessionize.com/image/b3c9-400o400o1-R17yBwwZwF1qMcGS82udk4.jpg",
        "sessions": [
          {
            "id": 1058703,
            "name": "AI: Leveraging Conversational Automation and Data to Personalize the Global Event Economy"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://linkedin.com/in/orilekunke",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "cb80634b-d720-41ba-8495-ab1ab5a9f4cf",
        "firstName": "Emmanuel",
        "lastName": "Gopeh",
        "fullName": "Emmanuel Gopeh",
        "bio": "Emmanuel is the founder of zarnite an AI native company, with over 4 years of experience in backend development and cloud computing he understands the industry trends. He enjoys traveling and having deep conversations with people.",
        "tagLine": "Founder of zarnite ",
        "profilePicture": "https://sessionize.com/image/cbd2-400o400o1-V5YHDE7U9VRCXfrwq4hw7z.png",
        "sessions": [
          {
            "id": 1050064,
            "name": "Man + machine: why the future belongs to augmented, not artificial intelligence"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://linkedin.com/in/emmanuel-g-b5b175139",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "17067161-57eb-41c3-9e9a-93e598a58461",
        "firstName": "Esta",
        "lastName": "Etim",
        "fullName": "Esta Etim",
        "bio": "Esta Richard Etim also known as Esta Richards, is a Global Wellness & Performance Consultant, Mental Health Educator, and Tech Ecosystem Speaker with over a decade of experience helping entrepreneurs, creatives, and professionals build sustainable success without burning out. She bridges the gap between high performance and holistic wellbeing by combining neuroscience, lifestyle design, mental resilience, and body-mind practices.\r\n\r\nShe has trained and coached founders, product teams, and community leaders across Africa, the UK, and the US, and has been featured in international platforms such as Violet Simon UK Magazine’s “34 Disruptors to Watch.” As a certified Life Coach, Arts-in-Health Practitioner, and Wellness Ambassador, Esta is known for transforming complex health and performance concepts into practical, relatable frameworks that drive real results.\r\n\r\nPassionate about the future of tech in Africa, she advocates for mentally healthy work cultures, sustainable innovation, and people-centered leadership. When she’s not speaking on global stages or consulting for organizations, she empowers communities through programs that integrate movement, mental health, and personal development.\r\n\r\nA bonus Dance Therapy session could be thrown in to help founders stay grounded.",
        "tagLine": "Speaker & Consultant on mental wellbeing, sustainable performance, and people-centered leadership ",
        "profilePicture": "https://sessionize.com/image/c83d-400o400o1-KyW6etiYPSBHEU5TAGzmNM.jpg",
        "sessions": [
          {
            "id": 1060113,
            "name": "Sustainable Success in Tech: The Framework Nobody Talks About"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/esta-richard-etim",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "4ddc3b9e-76bc-4103-84ea-5d5c496b1f6c",
        "firstName": "Faith",
        "lastName": "Archibong",
        "fullName": "Faith Archibong",
        "bio": "Faith Archibong is a Blockchain Developer on BNB Smart chain and Sui. With over 1 year experience in building smart contracts and dApps, she has contributed to a lot of projects, some of which will be launching soon. She is a strong advocate for the adoption of Web3 technologies, and is always excited to share the benefits and opportunities in the Web3 Space especially for developers.",
        "tagLine": "Frontend & Blockchain Developer - BNB Smart Chain and Sui",
        "profilePicture": "https://sessionize.com/image/9400-400o400o1-vdEqz36BjGVNbeYA1LRtG.jpg",
        "sessions": [
          {
            "id": 1068009,
            "name": "The Web3 - Redefining value exchange"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/faith-archibong-b6b388271?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "636793e6-d8e1-4cfa-9b33-7a1050cf5eb6",
        "firstName": "Festus",
        "lastName": "Emmanuel Enang",
        "fullName": "Festus Emmanuel Enang",
        "bio": "Business Development Leader with 6+ years’ experience across software engineering, product design, product management, and digital business growth. Proven track record in driving revenue, securing strategic partnerships, and scaling innovative products in fintech, edtech, and startup ecosystems. Blends technical expertise with strong sales, branding, and market development skills to deliver impactful results. Recently spearheaded a ₦100M government-backed training program for tech talent incubation, while also growing student enrollment revenue to ₦3.5M monthly at Bravort. Passionate about building sustainable businesses and expanding market presence.",
        "tagLine": "Programs Director Startup and Talent Incubator",
        "profilePicture": "https://sessionize.com/image/082f-400o400o1-BxL3fNfYY3TA1aqfCXD32K.jpg",
        "sessions": [
          {
            "id": 1048737,
            "name": "From Idea to Impact: Turning Code into Companies That Scale"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/thefestusenang",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "cc0a6f19-73d4-4c67-b974-0161c6ad0b79",
        "firstName": "Fidel",
        "lastName": "Awa-Abuon",
        "fullName": "Fidel Awa-Abuon",
        "bio": "Fidel Awa-Abuon is a seasoned Web3 educator and community builder with extensive knowledge and experience across DeFi, NFTs, DePINs, DAOs, and smart contract development on Sui. He currently leads the Sui on Campus Students Club at the University of Uyo.\r\nHe is proudly Cross Riverian, and is invested in promoting the growth and adoption of emerging technology in Cross River State.",
        "tagLine": "Club Lead - Sui on Campus Students Club",
        "profilePicture": "https://sessionize.com/image/3b01-400o400o1-fZUUFE11TeCrBxNerojuz4.jpg",
        "sessions": [
          {
            "id": 1068009,
            "name": "The Web3 - Redefining value exchange"
          }
        ],
        "isTopSpeaker": false,
        "links": [],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "4630e07f-b7fc-47e1-bb42-90f6832204b4",
        "firstName": "Israel",
        "lastName": "Iyonsi",
        "fullName": "Israel Iyonsi",
        "bio": "I’m a Software Engineer at Altexsoft, a global technology consulting company based in the United States. My work focuses on designing and building intelligent, scalable, and human-centered systems that bring together AI, cloud technologies, and software engineering to solve real-world problems.\r\n\r\nMy journey began in 2010 when, as a curious teenager in Nigeria, I discovered programming through a simple HTML tutorial on YouTube. With limited resources, I learned to code on borrowed laptops and when those weren’t available, I wrote code by hand during power outages.\r\n\r\nSince then, I’ve contributed to projects across fintech and enterprise sectors for organizations like Hydrogen, Zenith Bank, UBA, and Kindred, building systems that process millions in transactions. I hold a Software Engineering Diploma from Decagon Institute, am Scrum certified, and currently pursuing my MSc in Computer Science at the University of East London.\r\n\r\nI believe technology is limitless when driven by curiosity and purpose. My mission is to help others go beyond the code to build solutions that are impactful, inclusive, and transformative.",
        "tagLine": "Software Engineer at Altexsoft | MSc Computer Science Candidate | AI & Cloud Enthusiast",
        "profilePicture": "https://sessionize.com/image/86da-400o400o1-Lrv4uzwGvCJrbWjK5A6SNf.jpg",
        "sessions": [
          {
            "id": 1064197,
            "name": "Beyond the Code: Building Technology that Shapes Tomorrow"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/iyonsi-israel-123b72b0/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "88a5469d-d10d-45ba-a837-a127d7dff08e",
        "firstName": "Maryjoyous",
        "lastName": "Mbang",
        "fullName": "Maryjoyous Mbang",
        "bio": "Maryjoyous is a noncoding Techsis, a web3 content creator and a crypto trader \r\nShe’s passionate about simplifying blockchain concepts for everyday Africans.\r\nHer area of focus is Web3 education and digital empowerment, where she create relatable content that helps people understand blockchain, decentralized finance (DeFi), and new earning opportunities like SocialFi, GameFi, and InfoFi. ",
        "tagLine": "Web3 Content creator and blockchain enthusiast ",
        "profilePicture": "https://sessionize.com/image/6d46-400o400o1-nDmWkj7z4Eh53SJebZ4e3L.jpg",
        "sessions": [
          {
            "id": 1068009,
            "name": "The Web3 - Redefining value exchange"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "http://linkedin.com/in/maryjoyous",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "08fc6af4-7b09-405b-b41b-5994749e46fd",
        "firstName": "Matilda",
        "lastName": "Anashie",
        "fullName": "Matilda Anashie",
        "bio": "Matilda is a product designer, mentor, an open-source design contributor, and a user experience advocate helping to improve the products at Wowzi, Kenya. \r\n\r\nWith over five years of experience, she has carved out a niche as a multidisciplinary designer, with a background that has allowed her to create a systematic design approach with the ability to think divergently and come up with creative, simple solutions. ",
        "tagLine": "Product Designer, Must Company",
        "profilePicture": "https://sessionize.com/image/3b25-400o400o1-Jk96vjD9FwayvkxkPg78Et.jpg",
        "sessions": [
          {
            "id": 1061837,
            "name": "Designing with Agentic AI: When Your Tools Start Thinking for Themselves"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/matildaanashie",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "8b4ee16c-9d8f-4fad-aa12-ded19e9cc826",
        "firstName": "Mitchell",
        "lastName": "Owoh",
        "fullName": "Mitchell Owoh",
        "bio": "Mitchell Owoh is the Founder & CEO of Nippyy, a stablecoin-backed fintech startup developing innovative financial solutions for Africa’s digital economy. Nippyy is designed to facilitate instant, secure, and efficient local and cross-border financial transactions at a fraction of the traditional cost, redefining how people and businesses move money across the continent and globally.\r\n\r\nWith a background in Civil and Environmental Engineering from the University of Calabar, I am Passionate about technology, entrepreneurship, and youth empowerment. Mitchell represents a new generation of African founders driven by purpose and impact.\r\n\r\nCurrently preparing Nippyy for its beta launch, he is deeply committed to building technology that simplifies access to finance and accelerates financial inclusion across the continent.\r\n\r\nIn addition to his work in fintech, Mitchell possesses expert-level technical skills in product and graphic design, with years of experience in digital marketing and creative direction. His multidisciplinary background enables him to bridge the gap between technology, design, and business, crafting solutions that are not only functional but also user-centred and visually impactful.\r\n\r\nThrough his work and leadership journey, Mitchell continues to inspire emerging entrepreneurs to start where they are, build boldly, and create value that transforms lives.",
        "tagLine": "Founder/CEO, Nippyy.",
        "profilePicture": "https://sessionize.com/image/44ec-400o400o1-GtDoy3M8BDqt54i3zj3kZG.jpg",
        "sessions": [
          {
            "id": 1048922,
            "name": "Building Tech Startups in Africa: Vision, Grit, and the Power of Possibility"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/mitchell-owoh-gmnse-2a1440237?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "654ccdeb-4406-4721-b008-449e97e89e83",
        "firstName": "Oluwatobi ",
        "lastName": "Oladapo",
        "fullName": "Oluwatobi Oladapo",
        "bio": "Oluwatobi Oladapo is Head of Product at myCircle, where he leads product innovation in social and behavioral finance. He previously co-founded Exchequer, a USSD-native savings platform. He speaks on why real adoption in fintech and beyond depends not only on trust but on embedding products into people’s existing behaviors, what he calls ‘behavior as infrastructure.\r\n",
        "tagLine": "Head of Product, myCircle Africa",
        "profilePicture": "https://sessionize.com/image/b65f-400o400o1-KCLfR5uuS3Qjw3KCuEcsC3.jpg",
        "sessions": [
          {
            "id": 1056412,
            "name": "Why Your MVP Failed: The Missing Infrastructure is Human Behavior"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/oluwatobisamueloladapo/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "a0abda63-f0cb-45de-a683-4ab25ca072e6",
        "firstName": "Patrick",
        "lastName": "Ndifon",
        "fullName": "Patrick Ndifon",
        "bio": "Patrick M. Ndifon Jnr. is an innovation strategist, product manager, and ecosystem builder dedicated to shaping Africa’s workforce and startups. Nationally, he serves as Innovation Lead on the Job Creation & Placement team at 3MTT Nigeria, where he designs workforce programs, hackathons, and job initiatives impacting learners across the country. At the state level, he is the Coordinator and Community Manager for 3MTT in Cross River State and the Innovation Ecosystem Development Lead at the Cross River State ICT Hub, a government-backed initiative supporting startups, SMEs, and talent.\r\n\r\nPatrick is also the Founder of Hack51 Africa, a competency validation engine helping talent prove their skills through real-world projects, and the Executive Director of PSIFON Org, which supports innovators in achieving product–market fit and accessing new markets. Through ventures like FIRST Labs and Cally Valley, he has helped startups refine products and SMEs connect to Africa’s ₦17 billion export market.\r\n\r\nHis mission is to future-proof Africa’s workforce and ecosystems while positioning secondary cities like Calabar as globally competitive innovation hubs.",
        "tagLine": "Innovation Lead, 3MTT Nigeria | Founder, Hack51 Africa | Ecosystem Builder, Cross River ICT Hub",
        "profilePicture": "https://sessionize.com/image/69fe-400o400o1-Xd4zW9UDAeXzovyg6us9p7.jpg",
        "sessions": [
          {
            "id": 1043156,
            "name": "Building Scalable Startups from Africa’s Secondary Cities: Lessons in Innovation and Growth"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://linkedin.com/in/pmndifon",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "af078d68-c5b4-4069-bf82-d7581e259a28",
        "firstName": "Safe",
        "lastName": "Sunday",
        "fullName": "Safe Sunday",
        "bio": "With a passion for blockchain technology and decentralized finance, Safe has been actively involved in the Web3 ecosystem for about years. Starting as a content writer, She has explored various blockchain platforms and transitioned through DeFi to Web3 education. She has volunteered at numerous blockchain events, guiding individuals on their Web3 journey, and teaching them how to engage within the space. She has a goal to spread awareness about Web3's transformative potential through education and community building, empowering others to explore the abundant opportunities in this space.",
        "tagLine": "DeFi Expert. Club Lead - Sui on Campus Unical. ",
        "profilePicture": "https://sessionize.com/image/c096-400o400o1-fzcvN2vrLu6XDCK7g79NHH.jpg",
        "sessions": [
          {
            "id": 1068009,
            "name": "The Web3 - Redefining value exchange"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/safe-barisanem-sunday",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "5a1475cf-f07b-4b9a-93bc-f676927b4764",
        "firstName": "Wonderful",
        "lastName": "Uche",
        "fullName": "Wonderful Uche",
        "bio": "\r\nI’m Wonderful Uche a 14-year-old developer and tech enthusiast,website developer and python developer  from Aba, Nigeria.\r\nI’m passionate about web development and AI, and I use online resources daily to build my skills.\r\nI have  a year plus of experience in the tech/ software development industry.\r\nI believe technology is the greatest equalizer for young Africans, and I want to inspire others to start learning early and build boldly.\r\n\r\nMy goal is to represent the next generation of builders in Africa ; young people turning curiosity into creativity.\r\n",
        "tagLine": "Courage, curiosity, and code can start a movement.",
        "profilePicture": "https://sessionize.com/image/4f6d-400o400o1-Qgqb7HAD7RAiswa372z22P.png",
        "sessions": [
          {
            "id": 1057514,
            "name": "Starting Young, Dreaming Bold: Lessons from a Teenager Building a Tech Future"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/uche-wonderful-221669364?source=user_about----------------------669ec6af6978----------------------",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406030,
                "name": "In person"
              }
            ],
            "sort": 14
          }
        ]
      }
    ]
  },
  {
    "groupId": 406031,
    "groupName": "Virtual",
    "speakers": [
      {
        "id": "ea048e6b-14f6-4668-af91-ec12d0045002",
        "firstName": "Abubakar Taiye Hassanat.",
        "lastName": "N/A",
        "fullName": "Abubakar Taiye Hassanat. N/A",
        "bio": "Hassanat is a motivated, and results-driven Product Manager and Innovator with experience working with diverse cross-functional teams to develop, manage, and deliver projects across industries such as HR-Tech, Health-Tech, Gov-Tech, Ed-Tech, and currently FinTech. \r\n\r\nWith a background in the Healthcare sector and Customer Success Management, she has also cultivated a strong interest in Business Management, Product Growth, and Customer Success over the years.\r\n\r\nBeyond product development, Hassanat is deeply passionate about Career Development, Coaching, Open-Source Innovation, and Community Building. As a strong advocate for open-source technology, she actively contributes to and builds open-source projects, recognizing their transformative impact on society through community-driven innovation and skills development advocacy.\r\n",
        "tagLine": "Engineering  Lead at Roqqu. Founder, FUSE Varsity",
        "profilePicture": "https://sessionize.com/image/c2b3-400o400o1-9j24S2L2Y7e6zrvPCaPTnS.jpg",
        "sessions": [
          {
            "id": 1058044,
            "name": "How to Stand Out and Stay Valuable in Today’s Talent Economy"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/hassanat-abubakar-b708a1128?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "c25687ad-17f6-471a-a2a8-b0c1ef6454a4",
        "firstName": "Awajimimam",
        "lastName": "Hebron",
        "fullName": "Awajimimam Hebron",
        "bio": "Hebron Awajimimam is a WordPress Developer and Designer with nearly five years of experience creating and teaching digital solutions. He is the Founder of AHLFIGH, CEO of Fixacad, and Co-Founder of Kryptfo, where he leads design and digital strategy. Passionate about tech education, Hebron has trained creatives through the NITDA Animation Track, facilitated Web Design Bootcamps with The Bridge Leadership Foundation, and hosted his own design classes. He believes creativity and curiosity are the real entry points into tech — not degrees. Through his work, he continues to help individuals and brands build, grow, and express ideas with confidence.",
        "tagLine": "Founder, AHLFIGH | CEO, Fixacad | WordPress Developer/Designer",
        "profilePicture": "https://sessionize.com/image/b7d5-400o400o1-3HQ7wBaQGSQTZu4eBbNYiC.jpg",
        "sessions": [
          {
            "id": 1049719,
            "name": "Start Where You Are: Growing a Career in Tech Without a Computer Science Degree"
          }
        ],
        "isTopSpeaker": false,
        "links": [],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "49794b06-6c8b-4c6e-9b0a-fe65f2388fe9",
        "firstName": "Caroline Nicole",
        "lastName": "Letaru",
        "fullName": "Caroline Nicole Letaru",
        "bio": "Caroline Nicole Letaru is a globally recognized Career Coach and Talent Strategist at Kazini Consults, with over 6 years of experience empowering tech professionals across 12+ countries. She is known for helping developers and emerging tech leaders unlock international opportunities through strategic career planning, skill building, and high-impact coaching.\r\n\r\nNicole has led technical recruitment for global institutions such as the United Nations and UNHCR, and has coached over 500+ professionals including software engineers, UX designers, and AI specialists helping them transition into global careers and remote work ecosystems.\r\n\r\nShe is a seasoned international speaker who has graced renowned stages including the International AIDS Society Conference (Germany), Going Global Conference (UK), and the SCORE Conference (Tanzania). Her thought leadership earned her the Best Essay Award at the South American Business Forum (SABF) in Argentina, recognizing her voice on youth, development, and innovation.\r\n\r\nNicole’s work focuses on building future-proof careers for African professionals in tech. Through Kazini Consults, she leads a community-first approach that equips talents to scale their impact with confidence, clarity, and visibility.",
        "tagLine": "Kazini Consults | Career Coach & Talent Strategist | Empowering Tech Professionals to Level Up",
        "profilePicture": "https://sessionize.com/image/331b-400o400o1-nmDKcAcjNL4KVSstjchoSw.jpg",
        "sessions": [
          {
            "id": 1063910,
            "name": "Building Human-Centered Careers in an AI-Powered World"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/nicoleletaru/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "b927dd1f-2d5f-4d30-9873-f527d20d9ae2",
        "firstName": "Chisom",
        "lastName": "Rutherford",
        "fullName": "Chisom Rutherford",
        "bio": "Chisom Rutherford is a final-year medical student and an AI engineer focused on building healthcare solutions with AI. \r\n\r\nHe has built and deployed machine learning models, clinical AI systems, and patient-centered digital health tools. Currently, he works with health tech startups, contributing to clinical protocol design, AI safety, and product strategy. \r\n\r\nSome of his personal projects include a machine learning model that uses breath sounds to diagnose asthma; a model for recognising parasitised red blood cells on a blood film, among others.\r\n\r\nHis work sits at the intersection of medicine and technology, with a focus on building safe, scalable, and clinically meaningful AI solutions that improve patient care and system efficiency.",
        "tagLine": "Final year medical student, University of Calabar. Medical AI engineer at Welo Health, South Africa. ",
        "profilePicture": "https://sessionize.com/image/be65-400o400o1-HJ2YD3ihcCmFGrFHd6Bgyf.jpg",
        "sessions": [
          {
            "id": 1053843,
            "name": "How to Break into AI"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/chisomrutherford?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "dd8420ed-ac8e-4369-95ad-d8f872a735aa",
        "firstName": "Chukwuemeka Dennis",
        "lastName": "Abosi",
        "fullName": "Chukwuemeka Dennis Abosi",
        "bio": "Chukwuemeka Dennis is a fullstack developer with a strong focus on building scalable and efficient systems for startups and MSMEs.\r\n\r\nSince beginning his tech journey in 2021, he has developed a keen sense for problem-solving and has been actively involved in driving innovation wherever he is found.\r\n\r\nBeyond software development, Chukwuemeka is deeply committed to teaching and mentoring young talents at the start of their tech journeys. He believes that properly nurtured talent can be truly transformative, and has already guided 50+ students beginning their careers in software development.\r\n\r\nMost of his time is spent improving and scaling systems for end-users. He leverages up-to-date technologies, refactors codebases, and continuously seeks ways to make both new and existing solutions more efficient.\r\n\r\nOutside of tech, Chukwuemeka is a strong health advocate who believes that health is paramount to productivity and should always remain a top priority.\r\n\r\nHe is an innovator and strategist who is passionate about building solutions that empower both businesses and people.",
        "tagLine": "FullStack Developer , Co-Founder KwikSub VTU",
        "profilePicture": "https://sessionize.com/image/6eea-400o400o1-MZoCHNw6iXHT3FqeEX2yJ.png",
        "sessions": [
          {
            "id": 1047020,
            "name": "AI Hallucination"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/chux-dennis/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "7db9c23a-a563-4c77-89a1-1fb27f9ef0c1",
        "firstName": "Ekenedilichukwu",
        "lastName": "Okoli",
        "fullName": "Ekenedilichukwu Okoli",
        "bio": "I am the founder and CEO of D'roid Technologies Ltd a Nigerian SaaS company.",
        "tagLine": "D'roid Technologies ",
        "profilePicture": "https://sessionize.com/image/8f87-400o400o1-VSLMpdmakPfdPYA1q8i874.jpg",
        "sessions": [
          {
            "id": 1058425,
            "name": "Steps on starting your own Tech start Up"
          }
        ],
        "isTopSpeaker": false,
        "links": [],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "a3fa1cca-18a6-4754-9aca-173e2992b093",
        "firstName": "Fredrick",
        "lastName": "Abodunrin",
        "fullName": "Fredrick Abodunrin",
        "bio": "I am a Senior Backend Engineer with a passion for building the infrastructure that powers AI, EduTech and fintech applications. My experience includes architecting scalable, event-driven systems at Plus One Technology and developing secure payment and scheduling APIs at Hackthejobs / Grazac Technologies. With a strong background in Node.js, TypeScript, and microservices, I enjoy tackling complex challenges in real-time data processing and API integration. I am also committed to community growth, having mentored over 150 aspiring developers as a facilitator with TechyJaunt. ",
        "tagLine": "Grazac Technologies - Backend Engineer ",
        "profilePicture": "https://sessionize.com/image/5e01-400o400o1-BHHmUZUJxwxzuKnZCtdQG3.jpg",
        "sessions": [
          {
            "id": 1058188,
            "name": "From API to Insight: A Hands-On Guide to Integrating AI Services in Node.js"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/fredrickabodunrin/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "8e0b9b18-c7e3-41b0-92f5-45e1134bf210",
        "firstName": "Jackson",
        "lastName": "Abetianbe",
        "fullName": "Jackson Abetianbe",
        "bio": "Jackson Abetianbe is a Data Scientist, Fullstack Developer, and Mechatronics Engineering student with a growing interest in how software and hardware can come together to solve real problems. He works across AI/ML, IoT, robotics, and cloud technologies, always looking for ways to apply them in practical contexts like agriculture, logistics, and everyday automation. Jackson enjoys building tools that are both functional and user-friendly, and he has been involved in projects ranging from data-driven applications to small-scale robotics experiments. Alongside his technical work, he also runs Trex Media, where he applies his skills in design, communication, and digital storytelling to share ideas and connect with a wider audience. At Calabar Tech Conference 2025, Jackson will speak on how the fusion of digital intelligence and physical systems can unlock new opportunities for startups and innovators in Africa, bringing a fresh, hands-on perspective to the future of technology.",
        "tagLine": "Data Scientist & Fullstack Developer | Mechatronics Engineering Student | Bridging AI, Robotics & Web3 for Africa’s Future",
        "profilePicture": "https://sessionize.com/image/d44e-400o400o1-pfLa8rbrxqSUJpRjzUvfna.jpg",
        "sessions": [
          {
            "id": 1049217,
            "name": "From Code to Circuits: AI, Blockchain & Robotics for Africa’s Next Startups"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/jackson-abetianbe-59b14a347/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "2a54f386-eb32-4f16-8968-5eeb49568c79",
        "firstName": "Jamiu",
        "lastName": "Adam",
        "fullName": "Jamiu Adam",
        "bio": "Hi, I’m Adam. I’m a backend software engineer with experience building secure, scalable systems in fintech and payroll. At SeamlessHR, I spearheaded the migration of core payroll services into a microservices architecture, introducing Kafka, RabbitMQ, and Redis into the stack. More recently, at Deel, I led the transformation of a large Rails monolith into a modular NestJS/TypeScript system.\r\n\r\nAlong the way, I’ve worked with Node.js, TypeScript, NestJS, Docker, Kubernetes, Kafka, RabbitMQ, and AWS. I enjoy mentoring engineers, solving scaling challenges, and sharing practical lessons learned from real migrations that don’t always go as planned.",
        "tagLine": "Deel-Backend Engineer",
        "profilePicture": "https://sessionize.com/image/bb8d-400o400o1-YhFYcrWjbG7jcPSqVsDz4.jpg",
        "sessions": [
          {
            "id": 1058302,
            "name": "From Monolith to Microservices: Lessons Learned Migrating a Payroll Platform"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/adam-jamiu-88a6a619b/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "c99d31f8-39e0-44f7-a515-1a4d606738c2",
        "firstName": "Meshach",
        "lastName": "Philips",
        "fullName": "Meshach Philips",
        "bio": "Meshach Philips is a seasoned software developer and Founder of TechFace, the company behind innovative products like Gadlock, Sellamquick, Queek, and Happymob, an event marketplace. With over six years of experience, he currently serves as a developer at Nugi Tech and is a proud member of Forbes BLK.\r\n\r\nPassionate about transforming ideas into impactful products, Meshach has helped numerous startups launch and scale through affordable, high-quality tech solutions. His creativity and leadership have earned him recognition across Africa, including multiple wins at pitch competitions and hackathons with NITDA.",
        "tagLine": "TechFace - Founder/CEO",
        "profilePicture": "https://sessionize.com/image/88be-400o400o1-XDdbuSNKwv2JEnU9bHFzmE.jpg",
        "sessions": [
          {
            "id": 1058377,
            "name": "Building Scalable Startups: From Idea to MVP the Smart Way"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/meshach-philips-8aba63164?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "abdd5953-94d1-40a5-87bc-d060e152481b",
        "firstName": "Simeon",
        "lastName": "Williams Obot",
        "fullName": "Simeon Williams Obot",
        "bio": "Simeon Williams Obot is a distinguished technology leader, educator, and practitioner specializing in Cloud and DevOps transformation. As a Cloud Solutions Manager for a global giant in digital infrastructure, Simeon is responsible for designing, integrating, and managing complex, large-scale cloud strategies that drive business innovation and efficiency across diverse ecosystems.\r\n\r\nWith a robust 20-year career that spans multiple continents, Simeon possesses deep, hands-on experience integrating cutting-edge IT solutions for tech companies, both within Nigeria and globally. Simeon holds a degree in Computer Science and is currently pursuing a Master of Information Technology from the University of the People, California, USA, complemented by numerous high-value industry certifications.\r\n\r\nCrucially, Simeon is an accredited AWS re/Start Instructor who has successfully trained and mentored over 500 aspiring professionals in cloud computing, bridging the gap between foundational knowledge and practical industry application. This unique combination of executive-level cloud strategy and deep-rooted educational experience makes Simeon uniquely qualified to discuss the evolution of DevOps—from foundational IaC principles to the emerging paradigm of AI-as-Everything.\r\n\r\nSimeon's session will offer actionable takeaways for every level of the audience, from students seeking foundational knowledge to tech leaders shaping future infrastructure policy.",
        "tagLine": "Cloud & DevOps Manager",
        "profilePicture": "https://sessionize.com/image/6cda-400o400o1-nZQcnPiiGGzdS5VzvBcyX5.png",
        "sessions": [
          {
            "id": 1067815,
            "name": "Cloud and DevOps"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/simeon-williams-4b505216/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "29ada5d4-280a-4092-b9ba-97d04792a883",
        "firstName": "Toluwase",
        "lastName": "Olugbemiro",
        "fullName": "Toluwase Olugbemiro",
        "bio": "My name is Toluwase Olugbemiro. \r\n\r\nI am a brand communicator with experience building global communities for startups, offering strategy, and telling great stories. \r\n\r\nIn my short time in the industry, I have worked for startups bringing in a collective revenue of $10,000 and more via direct partnerships, negotiations and creative storytelling.\r\n\r\nI love anime, food and jazz music.",
        "tagLine": "Brand Communication Strategist",
        "profilePicture": "https://sessionize.com/image/382e-400o400o1-KZCnYeQrcypeETLvbY4Gep.jpg",
        "sessions": [
          {
            "id": 1048862,
            "name": "Understanding cold client outreach as a freelancer"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/toluwawseolugbemiro/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "3a094804-9cd6-46ca-9a11-101727e580e5",
        "firstName": "Tonivisual",
        "lastName": ".",
        "fullName": "Tonivisual .",
        "bio": "I’m tonivisual a Product Designer (UI/UX) and Framer Developer with a focus on creating intuitive, engaging digital experiences that balance creativity and function.\r\n\r\nI’ve always been drawn to design and art in all their forms. that genuine love for creativity is what drives my work today. Over the years, I’ve had the chance to collaborate with startups and forward thinking teams, using design to solve problems, tell stories and build experiences that connect",
        "tagLine": "Product Designer focused on creating impactful UI/UX that drives growth",
        "profilePicture": "https://sessionize.com/image/9d7e-400o400o1-XVPEmMHHrz5EQpY7pT7Fc7.png",
        "sessions": [
          {
            "id": 1043056,
            "name": "Designing Live: Breaking Down the Design Creative Process in Real Time"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/anthonyemedobi",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "6dc234f6-503a-4ae9-b51c-f3680f20976d",
        "firstName": "Uwuma Queenette",
        "lastName": "Otuwarikpo",
        "fullName": "Uwuma Queenette Otuwarikpo",
        "bio": "Otuwarikpo Uwuma Queenette is a passionate Product Manager and Certified Scrum Master currently with Stacpay, where she leads the development of innovative fintech solutions that enhance digital payment experiences. Formerly at TraderApp, she managed initiatives that empowered retail investors through social trading and education-driven tools.\r\n\r\nHer product portfolio spans fintech, edtech, and event-tech, including impactful products such as PayEasy, Pathfinder, and PartyJor. Beyond product management, she is a community builder and mentor, dedicated to equipping young professionals with the skills to thrive in technology and leadership.\r\n\r\nQueenette has been recognized as a Top 10 Exceptional Professional of the Year in Tech (TIBA Awards), a two-time Best Graduating Student at HerTechTrail Academy, and a proud 2023/24 WomenTechster Fellow by Tech4Dev. She embodies a vision of transforming ideas into products that connect people, purpose, and progress.",
        "tagLine": "Empowering ideas to become impactful products.",
        "profilePicture": "https://sessionize.com/image/d1cb-400o400o1-W2NcGVdTz3KBxsayV7k1Mp.jpg",
        "sessions": [
          {
            "id": 1048574,
            "name": "From Idea to Impact: Building Products That People Love"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/uwuma-queenette-otuwarikpo-m-sc-cspo-csm-ba07b8185",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      },
      {
        "id": "e606333e-a1ea-4506-884e-303c43e01aa5",
        "firstName": "Victor ",
        "lastName": "Churchill ",
        "fullName": "Victor Churchill",
        "bio": "Victor Churchill is a Senior Product Designer with over 7 years of experience creating impactful, user-centered solutions across fintech, logistics, EdTech, and SaaS. He has led the design of platforms that secured multi-million dollar funding, integrated generative AI to boost user engagement, and scaled systems to serve tens of thousands of users. With a strong focus on measurable impact, inclusive design, and cross-functional collaboration, Victor brings a strategic yet practical approach to solving complex design challenges in emerging and global markets.",
        "tagLine": "Product Designer at ORB Innovations",
        "profilePicture": "https://sessionize.com/image/25b5-400o400o1-LcWtEhdWHhAy4NtJd7EKBL.jpg",
        "sessions": [
          {
            "id": 1064761,
            "name": "Build Fast, Perfect It Later: Designing and Shipping MVPs in an AI Culture"
          }
        ],
        "isTopSpeaker": false,
        "links": [
          {
            "title": "LinkedIn",
            "url": "https://www.linkedin.com/in/victor-c-akpan/",
            "linkType": "LinkedIn"
          }
        ],
        "questionAnswers": [],
        "categories": [
          {
            "id": 112921,
            "name": "Mode of delivery",
            "categoryItems": [
              {
                "id": 406031,
                "name": "Virtual"
              }
            ],
            "sort": 14
          }
        ]
      }
    ]
  }
]
